app/Http/Controllers/FrontendController.php

select * from `products` where `status` = 'active' and `brand_id` = 5 limit 20 offset 0
select count(*) as aggregate from `products` where `brand_id` = 5 and `status` = 'active' limit 20
---
    public function load_more_sunglass($frame=null,$type=null,$for=null){
        $products = DB::table('products')->join('categories','products.cat_id','=','categories.id')
                    ->join('brands','products.brand_id','=','brands.id')
                    ->select('products.*','categories.frame_type','brands.title as brandName')
                    ->where('products.status', 'active')
                    ->where('categories.frame_type', 31);

        if($type == 'women'){
            $products->whereIn('products.product_for', [28,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';
                $products->where('products.shape', $attribute);
            }
        }else if($type == 'men'){

            $products->whereIn('products.product_for', [27,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';

                $products->where('products.shape', $attribute);
            }
        }

        $products = $products->simplePaginate(20);

select count(*) as aggregate from `products` inner join `brands` on `products`.`brand_id` = `brands`.`id` where `products`.`brand_id` = 5 and `products`.`status` = 'active'
---
    public function productBrand(Request $request)
    {

        $brand_id = DB::table('brands')->where('slug',$request->slug)->first()->id ?? 0;
        $products = DB::table('products')->join('brands','products.brand_id','=','brands.id')
        ->select('products.id','products.slug','products.price','products.title','products.cat_id','products.photo','products.product_for','brands.title as brandName')
        ->where('products.status', 'active')->where('products.brand_id', $brand_id)->simplePaginate(20);