app/Http/Controllers/FrontendController.php

select * from `products` left join `categories` on `categories`.`id` = `products`.`cat_id` left join `brands` on `brands`.`id` = `products`.`brand_id` where `products`.`status` = 'active'
select * from `attributes`
select * from `products` where `status` = 'active' and `is_featured` = 1 order by `price` desc limit 2
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `products` where `status` = 'active' order by `id` desc limit 8
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
select * from `brands` where `status` = 'active' order by `title` asc
select `id`, `slug`, `price`, `title`, `photo`, `product_for` from `products` where `status` = 'active' order by `id` desc
---
    public function home()
    {
        $productWithColor = Product::where('products.status', 'active')
            ->leftJoin('categories', function ($join) {
                $join->on('categories.id', '=', 'products.cat_id');
            })->leftJoin('brands', function ($join) {
                $join->on('brands.id', 'products.brand_id');
            })->get();

            // dd( Product::variant(1,[27,30]));
        $attribute = Attribute::get();
        $data['female_eyeglasses'] = Product::femaleEyeglasses();
        $data['male_sunglasses'] = Product::maleSunglasses();
        $data['female_sunglasses'] = Product::femaleSunglasses();
        $data['male_eyeglasses'] = Product::maleEyeglasses();

        $data['featured'] = Product::where('status', 'active')->where('is_featured', 1)->orderBy('price', 'DESC')->limit(2)->get();

        $data['posts'] = Post::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();

        $data['banners'] = Banner::where('status', 'active')->limit(3)->orderBy('id', 'DESC')->get();

        // return $banner;

        $data['products'] = Product::where('status', 'active')->orderBy('id', 'DESC')->limit(8)->get();

        $data['category'] = Category::where('status', 'active')->where('is_parent', 1)->orderBy('title', 'ASC')->get();

        // return $category;
        $data['brand_img'] =  Brand::where('status', 'active')->orderBy('title')->get();

        $product_variant = Product::where('status', 'active')->orderBy('id', 'DESC')->get(['id','slug','price','title','photo','product_for']);

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31 limit 20 offset 0
select count(*) as aggregate from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31
select `id`, `slug`, `price`, `title`, `cat_id`, `photo`, `product_for` from `products` where `status` = 'active' order by `id` desc
select * from `brands` order by `created_at` desc limit 10
select * from `attributes` where `attribute_type` = 'shape'
select * from `attributes` where `attribute_type` = 'material'
---
    public function frontend_sunglass($type=null,$for=null)
    {
        $sunglasses = Product::join('categories','products.cat_id','=','categories.id')
                        ->select('products.*','categories.frame_type')
                        ->where('products.status', 'active')->where('categories.frame_type', 31);

        if($type == 'women'){
            $sunglasses->whereIn('products.product_for', [28,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';
                $sunglasses->where('products.shape', $attribute);
            }
        }else if($type == 'men'){

            $sunglasses->whereIn('products.product_for', [27,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';

                $sunglasses->where('products.shape', $attribute);
            }
        }

        $data['products_count'] = $sunglasses->count();
        $data['sunglasses'] = $sunglasses->paginate(20);
        $product_variant = Product::where('status', 'active')->orderBy('id', 'DESC')->get(['id','slug','price','title','cat_id','photo','product_for']);
        $data['product_variant'] = $product_variant;

        $data['product_variant'] = $product_variant;
        $data['brand'] = Brand::take(10)->latest()->get();
        $data['shapes'] = Attribute::where('attribute_type','shape')->get();
        $data['materials'] = Attribute::where('attribute_type','material')->get();
        $data['type'] = Attribute::where('attribute_type','type')->get();

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31 limit 20 offset 20
select count(*) as aggregate from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31
select `id`, `slug`, `price`, `title`, `cat_id`, `photo`, `product_for` from `products` where `status` = 'active' order by `id` desc
select * from `products` where `status` = 'active' limit 20 offset 0
select count(*) as aggregate from `products` where `status` = 'active'
---
    public function load_more_sunglass($frame=null,$type=null,$for=null){
        $products = Product::join('categories','products.cat_id','=','categories.id')
                    ->select('products.*','categories.frame_type')
                    ->where('products.status', 'active')->where('categories.frame_type', 31);

        if($type == 'women'){
            $products->whereIn('products.product_for', [28,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';
                $products->where('products.shape', $attribute);
            }
        }else if($type == 'men'){

            $products->whereIn('products.product_for', [27,30]);
            if($for != null){
                $attribute = Attribute::where('name',$for)->first()->id ?? '';

                $products->where('products.shape', $attribute);
            }
        }

        $products = $products->paginate(20);
        $ip_country = $this->ip_country ?? '';
        $product_variant = Product::where('status', 'active')->orderBy('id', 'DESC')->get(['id','slug','price','title','cat_id','photo','product_for']);
        $data['products'] = $products;
        $data['product_variant'] = $product_variant;
        $data['ip_country'] = $ip_country;

        $view = view('frontend.pages.section.load_more_products',$data)->render();
        return response()->json(['status'=>1, 'more_data'=>$products->count(), 'html'=>$view]);

select * from `brands` where `slug` = 'carrera' limit 1
select `products`.`id`, `products`.`slug`, `products`.`price`, `products`.`title`, `products`.`cat_id`, `products`.`photo`, `products`.`product_for`, `brands`.`title` as `brandName` from `products` inner join `brands` on `products`.`brand_id` = `brands`.`id` where `products`.`status` = 'active' and `products`.`brand_id` = 5 limit 20
select `id`, `slug`, `price`, `title`, `cat_id`, `photo`, `product_for` from `products` where `status` = 'active' order by `id` desc
---
    public function productBrand(Request $request)
    {

        $brand_id = \DB::table('brands')->where('slug',$request->slug)->first()->id ?? 0;
        $products = \DB::table('products')->join('brands','products.brand_id','=','brands.id')
        ->select('products.id','products.slug','products.price','products.title','products.cat_id','products.photo','products.product_for','brands.title as brandName')
        ->where('products.status', 'active')->where('products.brand_id', $brand_id)->limit(20)->get();

        $data['products_count'] = 0;
        $data['products'] = $products;
        $product_variant = \DB::table('products')->select('id','slug','price','title','cat_id','photo','product_for')->where('status', 'active')->orderBy('id', 'DESC')->get();

select `id`, `slug`, `price`, `cat_id`, `title`, `photo`, `product_for` from `products` where `status` = 'active' order by `id` desc
select * from `products` where `brand_id` = '5' and `status` = 'active' limit 20 offset 20
select count(*) as aggregate from `products` where `brand_id` = '5' and `status` = 'active'
---
    public function load_more_brands($brand)
    {
        $products = Product::where('brand_id',$brand)->where('status', 'active');
        $product_variant = Product::where('status', 'active')->orderBy('id', 'DESC')->get(['id','slug','price','cat_id','title','photo','product_for']);

        $products = $products->paginate(20);
        $ip_country = $this->ip_country ?? '';
        $data['products'] = $products;
        $data['product_variant'] = $product_variant;
        $data['ip_country'] = $ip_country;

        $view = view('frontend.pages.section.load_more_products',$data)->render();
        return response()->json(['status'=>1, 'more_data'=>$products->count(), 'html'=>$view]);

select * from `brands` where `status` = 'active' order by `title` asc
---
    public function frontend_brands()
    {
        $brand_data['brand_img'] =  Brand::where('status', 'active')->orderBy('title')->get();

select * from `users` where `email` = 'admin@gmail.com' and `role` = 'user' and `status` = 'active' limit 1
---
    public function loginSubmit(Request $request)
    {

        $data = $request->all();
        $user = User::where('email',$data['email'])->where('role','user')->where('status','active')->first();