app/Http/Controllers/HomeController.php

    public function profile(){

        $countries = Country::all();
        $states = State::all();
---
select * from `countries`
select * from `states`

    public function profileUpdate(Request $request,$id){

        $user=User::findOrFail($id);
        $data=$request->all();
        $status = $user->fill($data)->save();
---
select * from `users` where `users`.`id` = '40' limit 1
update `users` set `first_name` = 'Muhammad Hamza', `last_name` = 'Qadri', `phone` = '03077087412', `country_id` = '166', `zipcode` = '54810', `address_1` = 'h#3,St#62,area dar ul islam', `address_2` = '62', `users`.`updated_at` = '2022-09-23 04:32:55' where `id` = 40

    public function address(){
        $address = Address::where('user_id',Auth::id())->get();
---
select * from `addresses` where `user_id` = 40

    public function addressCreate(){
        $countries = Country::all();
        $states = State::all();
---
select * from `countries`
select * from `states`

    public function addressSave(Request $request)
    {

        try{
            $data = $request->all();
            $data['user_id'] = Auth::id();

            Address::create($data);
---
insert into `addresses` (`title`, `first_name`, `last_name`, `email`, `country_id`, `state_id`, `zipcode`, `company`, `address_1`, `address_2`, `user_id`, `updated_at`, `created_at`) values ('Home', 'Winifred', 'Jacobs', 'lodyqoki@mailinator.com', '198', '3540', '90519', 'Vel in quis distinct', '22 Clarendon Street', 'Dolorem nihil odio q', 40, '2022-09-23 18:02:01', '2022-09-23 18:02:01')

    public function addressEdit($id){
        $address = Address::find($id);
        $countries = Country::all();
        $states = State::all();
---
select * from `addresses` where `addresses`.`id` = '1' limit 1
select * from `countries`
select * from `states`

    public function addressUpdate(Request $request,$id){
        // return $request->all();
        try{
            $user = Address::findOrFail($id);
            $data = $request->all();
            $data['user_id'] = Auth::id();
            $status = $user->fill($data)->save();
---
select * from `addresses` where `addresses`.`id` = '1' limit 1
update `users` set `first_name` = 'Jolene', `last_name` = 'Norman', `email` = 'ropeqo@mailinator.com', `state_id` = '3501', `country_id` = '94', `zipcode` = '78619', `address_1` = '20 North First Lane', `address_2` = 'Nihil qui quos amet', `users`.`updated_at` = '2022-09-23 17:57:59' where `id` = 1
update `addresses` set `user_id` = 40, `title` = 'Rooney Mcgee', `first_name` = 'Ashton', `last_name` = 'Bolton', `email` = 'sytix@mailinator.com', `company` = 'Ut quia quo iure nih', `zipcode` = '74217', `state_id` = '2692', `country_id` = '13', `address_1` = '10 Hague Street', `address_2` = 'Ratione deserunt mol', `addresses`.`updated_at` = '2022-09-23 18:00:48' where `id` = 1

    public function orderIndex(){
        $orders = Order::orderBy('id','DESC')->where('user_id',auth()->user()->id)->paginate(10);
        return view('user.order.index')->with('orders',$orders);
---
select * from `orders` where `user_id` = 40 order by `id` desc limit 10 offset 0
select count(*) as aggregate from `orders` where `user_id` = 40
select * from `users` where `users`.`id` = '1' limit 1