app/Http/Controllers/ProductController.php

            ->join('attributes', 'attributes.id', '=', 'categories.frame_type')
            ->where('products.title', 'like', '%' . $searchValue . '%')
            // ->where('brands.brandTitle', 'like', '%' .$searchValue . '%')
            // ->orWhere('products.brand_id', 'like', '%' . ($brand != null ? $brand->id : '') . '%')
            ->orWhere('attributes.name', 'like', '%' . $searchValue . '%')
            ->orWhere('products.product_ean_code', 'like', '%' . $searchValue . '%')
            ->orWhere('products.price', 'like', '%' . $searchValue . '%')
            ->orWhere('products.status', 'like', '%' . $searchValue . '%')
            ->orWhere('products.discount', 'like', '%' . $searchValue . '%')
            ->select('products.*', 'brands.id as brandId', 'categories.title as categoryTitle', 'brands.title as brandTitle', 'attributes.name as frameTypeName')
            ->skip($start)
            ->take($rowperpage)
            ->get();
---
select `products`.*, `brands`.`id` as `brandId`, `categories`.`title` as `categoryTitle`, `brands`.`title` as `brandTitle`, `attributes`.`name` as `frameTypeName` from `products` inner join `brands` on `brands`.`id` = `products`.`brand_id` inner join `categories` on `categories`.`id` = `products`.`cat_id` inner join `attributes` on `attributes`.`id` = `categories`.`frame_type` where `products`.`title` like '%%' or `brands`.`title` like '%%' or `attributes`.`name` like '%%' or `products`.`product_ean_code` like '%%' or `products`.`price` like '%%' or `products`.`status` like '%%' or `products`.`discount` like '%%' order by `id` asc limit 25 offset 0
select count(*) as aggregate from `products` where `title` like '%%'