app/Models/Product.php

select * from `products` order by `id` asc
---
    public static function getAllProduct(){
        return Product::with(['cat_info','sub_cat_info'])->orderBy('id','ASC')->get();

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 32 and `products`.`product_for` in (28, 30) and `products`.`is_featured` = 1 limit 6
---
    public static function femaleEyeglasses(){
        $products = Product::join('categories','products.cat_id','=','categories.id')->select('products.*','categories.frame_type')->where('products.status','active')->where('categories.frame_type',32)->whereIn('products.product_for', [28,30])->where('products.is_featured',1)->limit(6)->get();

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 32 and `products`.`product_for` in (27, 30) and `products`.`is_featured` = 1 limit 6
select `id`, `title`, `slug`, `price`, `photo` from `products` where `status` = 'active' and `id` != 42771 and `cat_id` = 83683
---
    public static function maleEyeglasses(){
        $products = Product::join('categories','products.cat_id','=','categories.id')->select('products.*','categories.frame_type')->where('products.status','active')
                    ->where('categories.frame_type',32)->whereIn('products.product_for', [27,30])->where('products.is_featured',1)->limit(6)->get();

         foreach($products as $product){
            $product->variant = Product::where('status','active')->where('id','!=',$product->id)->where('cat_id', $product->cat_id)->get(['id','title','slug','price','photo']);

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31 and `products`.`product_for` in (28, 30) and `products`.`is_featured` = 1 limit 6
---
    public static function femaleSunglasses(){
        $products = Product::join('categories','products.cat_id','=','categories.id')->select('products.*','categories.frame_type')->where('products.status','active')
                    ->where('categories.frame_type',31)->whereIn('products.product_for', [28,30])->where('products.is_featured',1)->limit(6)->get();

select `products`.*, `categories`.`frame_type` from `products` inner join `categories` on `products`.`cat_id` = `categories`.`id` where `products`.`status` = 'active' and `categories`.`frame_type` = 31 and `products`.`product_for` in (27, 30) and `products`.`is_featured` = 1 limit 6
---
    public static function maleSunglasses(){
        $products = Product::join('categories','products.cat_id','=','categories.id')->select('products.*','categories.frame_type')->where('products.status','active')
                    ->where('categories.frame_type',31)->whereIn('products.product_for', [27,30])->where('products.is_featured',1)->limit(6)->get();

select * from `products` where `id` = 42771 limit 1
---
    public function getAdminProductPriceAttribute()
    {
        return DB::table('products')->where('id',$this->id)->first()->price;