app/Providers/AppServiceProvider.php

    public function boot()
    {
        // dd(app());
        Schema::defaultStringLength(191);

        // Config::set('currencyPrice.rate', Currency::convert()->from('USD')->to(current_currency())->get());
        // $location = locationVal();
        // if($location){
        //     Config::set('currencyPrice.extra', DB::table('extras')->whereRaw('FIND_IN_SET(?, countries)', [$location->countryCode])->where('status','active')->first());
        // }


        $permissions = Permmission::where('role','superadmin')->get();

        View::composer('*', function($view) use($permissions){
            $view->with('permissions', $permissions->pluck('permission')->toArray() ?? []);
        });


        View::composer(['frontend.layouts.product_filter'], function($view) use($permissions){
            $attribute = DB::table('attributes')->get();

            $data['brand'] = DB::table('brands')->get();
            $data['shapes'] = $attribute->where('attribute_type','shape');
            $data['materials'] = $attribute->where('attribute_type','material');
            $data['type'] = $attribute->where('attribute_type','type');
            $data['gender'] = $attribute->where('attribute_type','product_for')->whereNotIn('name',['Junior','Unisex']);

            $view->with('brands',$data['brand']);
            $view->with('shapes',$data['shapes']);
            $view->with('materials',$data['materials']);
            $view->with('types',$data['type']);
            $view->with('genders',$data['gender']);
        });
---
select * from `brands`
select * from `attributes` where `attribute_type` = 'product_for' and `name` not in ('Junior', 'Unisex')